dataset_gen/Earlier_Datasets/NS_SVS_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(-0.12582695249611905 -0.10530527782546223 0.0)
(0.07887579843709304 0.003621155306882056 0.0)
(0.06663476464804013 -0.1002932931198982 0.0)
(-0.023437704223524793 -0.08793108177465474 0.0)
(0.006821189324718541 -0.21686902282260817 0.0)
(0.08770447391929843 -0.17616334560879 0.0)
(-0.04735345864280209 -0.32497870483663854 0.0)
(0.02879026445389468 -0.056206153657277866 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
